package prictise50;

import java.util.Scanner;

/**
 * 企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，低于20万元时，
 * 低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；20万到40万之间时，高于20万元的部分，
 * 可提成5%；40万到60万之间时高于40万元的部分，可提成3%；60万到100万之间时，高于60万元的部分，
 * 可提成1.5%，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润，求应发放奖金总数？
 */

public class lianxi12 {
    public static void main(String[] args) {
        Scanner s = new Scanner(System.in);
        System.out.println("额当月的利润为：");
        double m=s.nextInt();
        double n=0;
        if (m>0&&m<=10){
            n=m*0.1;
        }else if (m<20){
            n = 10*0.1+(m-10)*0.075;
        }else if (m<40){
            n=10*0.1+10*0.075+(m-20)*0.05;
        }else if (m<60){
            n = 10*0.1+10*0.075+20*0.05+(m-40)*0.03;
        }else if (m<=100){
            n = 10*0.1+10*0.075+20*0.05+20*0.03+(m-60)*0.015;
        }else {
            n = 10*0.1+10*0.075+20*0.05+20*0.03+40*0.015+(m-100)*0.01;
        }
        System.out.println("应发奖金总数为："+n+"万元");

    }
}
